{
    "status": "success",
    "totalResults": 87,
    "results": [
        {
            "title": "German AfD party claims Nord Stream 2 should be launched",
            "link": "https://english.pravda.ru/news/world/151553-afd/",
            "keywords": [
                "World"
            ],
            "creator": null,
            "video_url": null,
            "description": "Germany should launch Nord Stream 2 if Germany goes for it in exchange for Russia accepting for gas payments in euro again, says a member of the German Bundestag Committee on Foreign Policy, leader of the Alternative for Germany party Tino Krupalla. “Our party believes that the Federal Republic of Germany should in any case adhere to the introduction of Nord Stream 2. Therefore, I consider the currency issue as independent of the project. If the euro trade argument helps convince the federal government to put the pipeline into operation, it might be a good idea,\" the leader of the party told RIA Novosti. Although he stressed that current political circumstances in Europe complicate the possible agreement.",
            "content": null,
            "pubDate": "2022-04-29 11:37:00",
            "image_url": "https://english.pravda.ru/image/preview/article/5/5/3/151553_five.jpeg",
            "source_id": "pravda_ru",
            "country": [
                "russia"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "title": "Finland to Donate Millions of Dollars From Sale of Seized Bitcoin to Ukraine",
            "link": "https://news.bitcoin.com/finland-to-donate-millions-of-dollars-from-sale-of-seized-bitcoin-to-ukraine/",
            "keywords": [
                "News",
                "aid",
                "Bitcoin",
                "Bitcoins",
                "Brokers",
                "Coins",
                "confiscated",
                "conflict",
                "Crypto",
                "Cryptocurrencies",
                "Cryptocurrency",
                "customs",
                "Digital Currency",
                "donate",
                "Donation",
                "finland",
                "Finnish",
                "invasion",
                "Russia",
                "russian",
                "sale",
                "seized",
                "support",
                "Ukraine",
                "ukrainian",
                "War"
            ],
            "creator": [
                "Lubomir Tassev"
            ],
            "video_url": null,
            "description": "The government of Finland is discussing supporting Ukraine with part of the money from the liquidation of millions of dollars worth of cryptocurrency seized in crime investigations. Finnish authorities want to sell the bitcoins soon and say they couldn’t come up with a better idea for the proceeds. Finland Selects Brokers to Sell $75 Million […]",
            "content": "The government of Finland is discussing supporting Ukraine with part of the money from the liquidation of millions of dollars worth of cryptocurrency seized in crime investigations. Finnish authorities want to sell the bitcoins soon and say they couldn’t come up with a better idea for the proceeds. Finland Selects Brokers to Sell $75 Million of Confiscated Crypto Authorities in Helsinki have recently chosen two brokers to organize the sale of over €71 million ($75 million) worth of bitcoin (BTC) in the coming weeks. The country owns the coins that have been sized by Finnish Customs in the course of investigations into drug trafficking and other crimes. The agency has signed two-year contracts with Coinmotion Oy and Tesseract Group Oy and plans to sell the crypto during the spring and early summer, Bloomberg reported, quoting an emailed statement. Out of 1,981 bitcoins held by the customs office, 1,890 will be released. Most of them have been confiscated in raids carried out before 2018. That year, the State Treasury adopted guidelines for their storage, banning the customs authority from keeping the digital money on a crypto exchange, insisting it should be stored offline. Last July, а tender was launched for brokers that can help the Finnish government turn the digital assets into fiat currency. Finnish Customs Director of Financial Management Pekka Pylkkanen said at the time that the agency wants a permanent solution for selling cryptocurrencies forfeited to the state coffers. Finish Government to Donate Over Half of Proceeds From Crypto Sale to Ukraine Finland mow intends to use a large portion of the fiat it will receive from the sale to expand its financial support for Ukraine, which was invaded by Russia in late February. The decision has already been made, the Helsingin Sanomat newspaper unveiled on Wednesday, quoting knowledgeable sources. The government is yet to determine how much of the total will be sent to Kyiv, but in any case, the donation will represent a serious increase in Helsinki’s assistance for the Ukrainians. Since 2014, the Nordic country has granted the Eastern European nation €85 million. In February, the Finland government approved €14 million in humanitarian and development aid to Ukraine. The Finnish government began considering using the bitcoins to fund Ukraine in early March. Sending the crypto directly was also discussed as both the United Nations Children’s Fund (Unicef) and the U.N. High Commissioner for Refugees accept crypto donations, but it was eventually decided to convert the coins. On Wednesday, Finland’s Minister of Finance Annika Saarikko confirmed the country will provide Ukraine with more than half of the money raised in the crypto sale which is expected to bring €70–80 million. “I am open to whether these tens of millions of euros would now be quickly allocated as humanitarian aid in the middle of the war or also in part for reconstruction work in due course. That day is coming too,” Saarikko stated, while also noting she couldn’t think of a better use for the bitcoin. What do you think of Finland’s initiative to share some of the seized cryptocurrency with Ukraine? Tell us in the comments section below.",
            "pubDate": "2022-04-29 11:30:08",
            "image_url": null,
            "source_id": "bitcoin",
            "country": [
                "united states of america",
                "united kingdom",
                "india",
                "australia",
                "singapore",
                "saudi arabia",
                "canada"
            ],
            "category": [
                "business"
            ],
            "language": "english"
        },
        {
            "title": "GAIMIN Goes From Strength to Strength in Readiness for Its GMRX Listing",
            "link": "https://news.bitcoin.com/gaimin-goes-from-strength-to-strength-in-readiness-for-its-gmrx-listing/",
            "keywords": [
                "Sponsored",
                "GAIMIN"
            ],
            "creator": [
                "Bitcoin.com Media"
            ],
            "video_url": null,
            "description": "In readiness for the imminent listing of our crypto currency, GMRX, we want to explain our philosophy and strategy and answer a number of questions and address some misconceptions about GAIMIN. Why has GAIMIN established a successful esports company – GAIMIN Gladiators? GAIMIN.IO Ltd (GAIMIN) is a UK and Swiss based gaming company focused on […]",
            "content": "In readiness for the imminent listing of our crypto currency, GMRX, we want to explain our philosophy and strategy and answer a number of questions and address some misconceptions about GAIMIN. Why has GAIMIN established a successful esports company – GAIMIN Gladiators? GAIMIN.IO Ltd (GAIMIN) is a UK and Swiss based gaming company focused on helping the gaming community monetise the computational power of their gaming PC. GAIMIN has created a decentralised data processing network harnessing under utilised processing power typically found in gaming PC’s to create a world-wide decentralised data processing network, delivering “supercomputer” performance. GAIMIN targets the PC gamer as this market segment has the high performance devices and from our research, we found a typical gamer only uses their computer for gaming 20% of the day, leaving the computer switched on for 80% of the day. When a gamer downloads the GAIMIN app and connects their device to the GAIMIN decentralised data processing network, GAIMIN utilises this gaming downtime to enable a gamer to passively monetise their device. Participation in the GAIMIN distributed data processing network rewards the user in the form of GMRX, GAIMIN’s native cryptocurrency. Monetisation of devices participating in the network results in GAIMIN being remunerated in a number of different crypto and fiat currencies. GAIMIN consolidates these rewards into GMRX and returns upto 90% of the generated revenue back to the user, retaining 10% for its own operational activities. GAIMIN’s business model is based on increasing the number of users who actively participate in the GAIMIN network. The number of users who can participate in the GAIMIN network is unlimited. GAIMIN’s approach to identify potential users within the PC gaming industry is to generate brand awareness through the gaming and esports community. GAIMIN has created GAIMIN Gladiators, an esports community which currently manages 5 esports gaming teams, focussing on DOTA2, Rocket League, Pokemon Unit, Rainbow 6 Siege and CounterStrike: GO. These 5 esports teams have a global following of over 1 million gamers and their participation in esports tournaments and events provides a global brand reach of over 5 million followers. Through this marketing and the success of the esports teams, GAIMIN is generating significant global brand awareness of the GAIMIN brand and associated products and services. In its first three months, GAIMIN Gladiators has achieved success never seen before from newly established esports teams. GAIMIN Gladiators has already won over $100k and the DOTA 2 team have recently qualified as 1 of just 18 participants in the ESL One tournament in Stockholm. This tournament has a $500k prize pool and has a viewer reach of over 5 million followers both during and after the tournament. GAIMIN has established an esports company to increase brand awareness and to facilitate many more users of the GAIMIN application and allow followers of the esports team to build a community and generate passive rewards from following their favourite teams and players. Is GAIMIN a crypto mining company? GAIMIN’s approach to monetisation through its distributed data processing network is often associated with “crypto mining”, however this is not a true comparison. GAIMIN deploys a number of different monetization options within its platform, each with its own inherent profitability. The choice of monetisation functionality is determined by the GAIMIN AI engine, which identifies the most profitable functionality at any given time, assesses available resources (devices) and deploys these devices to process data, generating a return. GAIMIN’s network does “mine” (power blockchain computations) however GAIMIN also deploys its data processing network into other monetisation functionality, such as video rendering, which is a more profitable service, but has less continuous business requirements than the powering of blockchain computations. As such, the rewards returned to the user vary depending on services required by clients and so direct comparison to a typical service dedicated to mining is not appropriate for GAIMIN. So GAIMIN is not a “mining” company, it is a monetisation engine, capable of delivering rewards back to the user which are in excess of the rewards generated through mining applications. Creating a deflationary token Users earn GMRX through participation in the distributed data processing network. The earned GMRX can be held to increase the rewards earned for greater spending power in the GAIMIN marketplace and within in game economies supporting the GMRX token. Alternatively, when listed GMRX can be converted to other crypto or fiat currencies. GAIMIN’s approach is to incentivise users to utilise their earned GMRX within the GAIMIN ecosystem. GAIMIN has established a marketplace for the purchase of accessories, merchandise, in game assets and NFTs. When using earned GMRX for purchases, GAIMIN will reward the user in a number of ways – bonus GMRX, discounts on prices, enhanced NFT attributes for example. Creating a deflationary token allows token holders to retain a token with a real-world value through listing on exchanges whilst also creating value within digital ecosystems. Why is GAIMIN implementing a novel approach to NFT acquisition? NFTs are typically sold at a premium cost with a view to them being retained as a collectors asset, with potential increasing value. GAIMIN’s approach is the opposite. However the problem with this approach is that these NFTs must continue to have utility and use or be associated with unique and collectable assets that people want to trade. If utility and use is not maintained, interest in the NFT declines along with the value. As a gaming company, with blockchain and NFTs technology integrated into the most popular games, GAIMIN will be creating NFTs that are not only cheap but also usable within games. In order to incentivise users to generate their own GMRX and increase the number of GMRX, GAIMIN will create NFTs with purchase prices associated with typical passive earning rewards and also incentivise users to purchase NFTs with their passively earned GMRX. GAIMIN’s initial research indicates a typical user can earn around $1 per day when monetising their devices with GAIMIN. The actual earnings are dependent on the duration of monetisation activities and the performance of their device. Based on this $1 per day typical earning capability, GAIMIN will make available NFTs that can be purchased for less than 1 day’s monetization, or NFTs that can be purchased for say, 1 day’s, 1 week’s, 1 month’s typical monetization, for example – less than $1, $1, $7, $30. This will enable a gamer to quickly build their in-game assets based on their participation in the GAIMIN network and their retention of GMRX (as opposed to converting to fiat or other crypto). In addition, GAIMIN also allows users to acquire NFTs through duration of participation in the data processing network, rather than hashrate contribution. The more hours a user is connected to GAIMIN’s network, the better the NFT – this is irrespective of hashrate contribution. GAIMIN will also incentivise users to hold GMRX. A GMRX holder using their retained GMRX in the marketplace will receive discounts when purchasing with GMRX, will receive bonuses for holding GMRX and when using GMRX to purchase NFTs, the NFTs attributes will be enhanced. GAIMIN;s approach is to allow as many gamers as possible to obtain useable and functional NFTs for their gaming activities and move these assets into other games, retaining their investment in gaming. GAIMIN is creating the world’s first interoperable NFT WIth blockchain and NFT technology embedded into games, GAIMIN is at the forefront of gaming technology development. Previously a gamer purchases an in game asset, such as a sword and that asset could only be used in that game and for the purpose for which it was designed. So, moving to a different game was always a problem – building up an asset repository in one game meant the gamer had to restart building up their asset repository in the new game. NFTs are one solution to this problem – building an NFT based asset repository in a game allows the gamer to remove their NFT from one game and use it in another game, however a sword was always a sword and if the new game did not utilise swords, then this asset would be useless.Interoperable NFTs solve this problem. A sword in one game can become a flower in another game! GAIMIN is developing the world’s first interoperable NFTs through its GAIMCRAFT technology components. GAIMCRAFT integrates blockchain and NFT technology into existing games, such as Minecraft and GTA5. An interoperable NFT used in Minecraft will become a different asset in GTA5, making the NFT much more usable across games and allowing gamers to build a completely interoperable asset base based on their passive GMRX earnings. This will incentivise users to hold onto their GMRX and use it solely for GAIMIN-related purchases. No Gamer will be Left Behind GAIMIN will soon be listing its GMRX token on global exchanges. When the token lists, the GAIMIN platform will be released globally. At the moment, the platform is only available for limited download. GAIMIN are asking interested users to register their interest on the whiteline and we are releasing 100 download links a week to users. This is our final phase of testing with the app and platform and we are poised for worldwide growth. Very soon, we will be enabling anyone with a suitable device to passively earn GMRX rewards and either utilise them for in game purchases or convert to other crypto or fiat currencies. When used within the GAIMIN ecosystem, reward value will be enhanced through additional GMRX, discounted products and merchandise or enhanced NFT attributes. Any user can participate in the GAIMIN network – GAIMIN does not just reward users based on hashpower contribution, GAIMIN has also released a range of in game NFTs based on hours connected to the data processing network. This is hashpower agnostic and enables any gamer to obtain usable and functional NFTs. Over the next few years, GAIMIN’s strategy is to ensure we can support as many gamers as possible, irrespective of the performance of their device, irrespective of their location whilst improving the gaming experience for gamers and allowing them to retain and grow their investment in their gaming activities. So, Is GAIMIN an esports company? Yes and No! Is GAIMIN a “mining” company? Yes and No! Is GAIMIN a competitor to mining companies? No! Is GAIMIN creating a community of gamers who can retain their investment in their gaming? Definitely Is GAIMIN allowing a gamer to increase their investment in their gaming activities? Definitely Are gamers benefiting from their participation in the GAIMIN distributed data processing network? Yes Is GAIMIN enjoying this experience? Most definitely No gamer left behind! For more information on GAIMIN Gladiators click on this link: https://linktr.ee/GaiminGladiators For more information on GAIMIN click on this link: www.gaimin.io For up to date information, please follow the following GAIMIN social media accounts: Facebook: https://www.facebook.com/Gaimin.io Instagram: https://www.instagram.com/gaimin_io/ Twitter: https://twitter.com/GaiminIo LinkedIn: https://www.linkedin.com/company/gaimin/ YouTube: https://www.youtube.com/c/Gaimin Telegram: https://t.me/officialgaimin Discord: https://discord.gg/7XUnd2kjJK     This is a sponsored post. Learn how to reach our audience here. Read disclaimer below.",
            "pubDate": "2022-04-29 11:00:55",
            "full_description": "GAIMIN Goes From Strength to Strength in Readiness for Its GMRX Listing sponsored In readiness for the imminent listing of our crypto currency, GMRX, we want to explain our philosophy and strategy and answer a number of questions and address some misconceptions about GAIMIN. Why has GAIMIN established a successful esports company – GAIMIN Gladiators? GAIMIN.IO Ltd (GAIMIN) is a UK and Swiss based gaming company focused on helping the gaming community monetise the computational power of their gaming PC. GAIMIN has created a decentralised data processing network harnessing under utilised processing power typically found in gaming PC’s to create a world-wide decentralised data processing network, delivering “supercomputer” performance. GAIMIN targets the PC gamer as this market segment has the high performance devices and from our research, we found a typical gamer only uses their computer for gaming 20% of the day, leaving the computer switched on for 80% of the day. When a gamer downloads the GAIMIN app and connects their device to the GAIMIN decentralised data processing network, GAIMIN utilises this gaming downtime to enable a gamer to passively monetise their device. Participation in the GAIMIN distributed data processing network rewards the user in the form of GMRX, GAIMIN’s native cryptocurrency. Monetisation of devices participating in the network results in GAIMIN being remunerated in a number of different crypto and fiat currencies. GAIMIN consolidates these rewards into GMRX and returns upto 90% of the generated revenue back to the user, retaining 10% for its own operational activities. GAIMIN’s business model is based on increasing the number of users who actively participate in the GAIMIN network. The number of users who can participate in the GAIMIN network is unlimited. GAIMIN’s approach to identify potential users within the PC gaming industry is to generate brand awareness through the gaming and esports community. GAIMIN has created GAIMIN Gladiators, an esports community which currently manages 5 esports gaming teams, focussing on DOTA2, Rocket League, Pokemon Unit, Rainbow 6 Siege and CounterStrike: GO. These 5 esports teams have a global following of over 1 million gamers and their participation in esports tournaments and events provides a global brand reach of over 5 million followers. Through this marketing and the success of the esports teams, GAIMIN is generating significant global brand awareness of the GAIMIN brand and associated products and services. In its first three months, GAIMIN Gladiators has achieved success never seen before from newly established esports teams. GAIMIN Gladiators has already won over $100k and the DOTA 2 team have recently qualified as 1 of just 18 participants in the ESL One tournament in Stockholm. This tournament has a $500k prize pool and has a viewer reach of over 5 million followers both during and after the tournament. GAIMIN has established an esports company to increase brand awareness and to facilitate many more users of the GAIMIN application and allow followers of the esports team to build a community and generate passive rewards from following their favourite teams and players. Is GAIMIN a crypto mining company? GAIMIN’s approach to monetisation through its distributed data processing network is often associated with “crypto mining”, however this is not a true comparison. GAIMIN deploys a number of different monetization options within its platform, each with its own inherent profitability. The choice of monetisation functionality is determined by the GAIMIN AI engine, which identifies the most profitable functionality at any given time, assesses available resources (devices) and deploys these devices to process data, generating a return. GAIMIN’s network does “mine” (power blockchain computations) however GAIMIN also deploys its data processing network into other monetisation functionality, such as video rendering, which is a more profitable service, but has less continuous business requirements than the powering of blockchain computations. As such, the rewards returned to the user vary depending on services required by clients and so direct comparison to a typical service dedicated to mining is not appropriate for GAIMIN. So GAIMIN is not a “mining” company, it is a monetisation engine, capable of delivering rewards back to the user which are in excess of the rewards generated through mining applications. Creating a deflationary token Users earn GMRX through participation in the distributed data processing network. The earned GMRX can be held to increase the rewards earned for greater spending power in the GAIMIN marketplace and within in game economies supporting the GMRX token. Alternatively, when listed GMRX can be converted to other crypto or fiat currencies. GAIMIN’s approach is to incentivise users to utilise their earned GMRX within the GAIMIN ecosystem. GAIMIN has established a marketplace for the purchase of accessories, merchandise, in game assets and NFTs. When using earned GMRX for purchases, GAIMIN will reward the user in a number of ways – bonus GMRX, discounts on prices, enhanced NFT attributes for example. Creating a deflationary token allows token holders to retain a token with a real-world value through listing on exchanges whilst also creating value within digital ecosystems. Why is GAIMIN implementing a novel approach to NFT acquisition? NFTs are typically sold at a premium cost with a view to them being retained as a collectors asset, with potential increasing value. GAIMIN’s approach is the opposite. However the problem with this approach is that these NFTs must continue to have utility and use or be associated with unique and collectable assets that people want to trade. If utility and use is not maintained, interest in the NFT declines along with the value. As a gaming company, with blockchain and NFTs technology integrated into the most popular games, GAIMIN will be creating NFTs that are not only cheap but also usable within games. In order to incentivise users to generate their own GMRX and increase the number of GMRX, GAIMIN will create NFTs with purchase prices associated with typical passive earning rewards and also incentivise users to purchase NFTs with their passively earned GMRX. GAIMIN’s initial research indicates a typical user can earn around $1 per day when monetising their devices with GAIMIN. The actual earnings are dependent on the duration of monetisation activities and the performance of their device. Based on this $1 per day typical earning capability, GAIMIN will make available NFTs that can be purchased for less than 1 day’s monetization, or NFTs that can be purchased for say, 1 day’s, 1 week’s, 1 month’s typical monetization, for example – less than $1, $1, $7, $30. This will enable a gamer to quickly build their in-game assets based on their participation in the GAIMIN network and their retention of GMRX (as opposed to converting to fiat or other crypto). In addition, GAIMIN also allows users to acquire NFTs through duration of participation in the data processing network, rather than hashrate contribution. The more hours a user is connected to GAIMIN’s network, the better the NFT – this is irrespective of hashrate contribution. GAIMIN will also incentivise users to hold GMRX. A GMRX holder using their retained GMRX in the marketplace will receive discounts when purchasing with GMRX, will receive bonuses for holding GMRX and when using GMRX to purchase NFTs, the NFTs attributes will be enhanced. GAIMIN;s approach is to allow as many gamers as possible to obtain useable and functional NFTs for their gaming activities and move these assets into other games, retaining their investment in gaming. GAIMIN is creating the world’s first interoperable NFT WIth blockchain and NFT technology embedded into games, GAIMIN is at the forefront of gaming technology development. Previously a gamer purchases an in game asset, such as a sword and that asset could only be used in that game and for the purpose for which it was designed. So, moving to a different game was always a problem – building up an asset repository in one game meant the gamer had to restart building up their asset repository in the new game. NFTs are one solution to this problem – building an NFT based asset repository in a game allows the gamer to remove their NFT from one game and use it in another game, however a sword was always a sword and if the new game did not utilise swords, then this asset would be useless.Interoperable NFTs solve this problem. A sword in one game can become a flower in another game! GAIMIN is developing the world’s first interoperable NFTs through its GAIMCRAFT technology components. GAIMCRAFT integrates blockchain and NFT technology into existing games, such as Minecraft and GTA5. An interoperable NFT used in Minecraft will become a different asset in GTA5, making the NFT much more usable across games and allowing gamers to build a completely interoperable asset base based on their passive GMRX earnings. This will incentivise users to hold onto their GMRX and use it solely for GAIMIN-related purchases. No Gamer will be Left Behind GAIMIN will soon be listing its GMRX token on global exchanges. When the token lists, the GAIMIN platform will be released globally. At the moment, the platform is only available for limited download. GAIMIN are asking interested users to register their interest on the whiteline and we are releasing 100 download links a week to users. This is our final phase of testing with the app and platform and we are poised for worldwide growth. Very soon, we will be enabling anyone with a suitable device to passively earn GMRX rewards and either utilise them for in game purchases or convert to other crypto or fiat currencies. When used within the GAIMIN ecosystem, reward value will be enhanced through additional GMRX, discounted products and merchandise or enhanced NFT attributes. Any user can participate in the GAIMIN network – GAIMIN does not just reward users based on hashpower contribution, GAIMIN has also released a range of in game NFTs based on hours connected to the data processing network. This is hashpower agnostic and enables any gamer to obtain usable and functional NFTs. Over the next few years, GAIMIN’s strategy is to ensure we can support as many gamers as possible, irrespective of the performance of their device, irrespective of their location whilst improving the gaming experience for gamers and allowing them to retain and grow their investment in their gaming activities. So, Is GAIMIN an esports company? Yes and No! Is GAIMIN a “mining” company? Yes and No! Is GAIMIN a competitor to mining companies? No! Is GAIMIN creating a community of gamers who can retain their investment in their gaming? Definitely Is GAIMIN allowing a gamer to increase their investment in their gaming activities? Definitely Are gamers benefiting from their participation in the GAIMIN distributed data processing network? Yes Is GAIMIN enjoying this experience? Most definitely No gamer left behind! For more information on GAIMIN Gladiators click on this link: https://linktr.ee/GaiminGladiators For more information on GAIMIN click on this link: www.gaimin.io For up to date information, please follow the following GAIMIN social media accounts: Facebook: https://www.facebook.com/Gaimin.io Instagram: https://www.instagram.com/gaimin_io/ Twitter: https://twitter.com/GaiminIo LinkedIn: https://www.linkedin.com/company/gaimin/ YouTube: https://www.youtube.com/c/Gaimin Telegram: https://t.me/officialgaimin Discord: https://discord.gg/7XUnd2kjJK Tags in this story GAIMIN This is a sponsored post. Learn how to reach our audience here . Read disclaimer below. Bitcoin.com Media Bitcoin.com is the premier source for everything crypto-related. Contact ads@bitcoin.com to talk about press releases, sponsored posts, podcasts and other options. Quik․com's Limited NFT Domains Minting is Now Live SPONSORED | 3 days ago The Olive Corporation Could Be the Next Big Thing in Crypto, the Metaverse and the Food Sector SPONSORED | 4 days ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article TRON Defines the Spend for its $1,111,111,111 Ecosystem Fund Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer More Popular News In Case You Missed It Ripple CEO: SEC Lawsuit Over XRP 'Has Gone Exceedingly Well' The CEO of Ripple Labs says that the lawsuit brought by the U.S. Securities and Exchange Commission (SEC) against him and his company over XRP \"has gone exceedingly well.\" He stressed: \"This case is important, not just for Ripple, it’s ... read more. Draft Law Regulating Aspects of Crypto Taxation Submitted to Russian Parliament NFT Sales Volume Saw a Small Uptick This Week — Moonbirds, Mutant Apes Take Top Sales SEC Risks Violating Admin Procedure Act by Rejecting Spot Bitcoin ETFs, Says Grayscale Ethereum Foundation's Financial Report Discloses It Holds $1.6 Billion in Assets, 80.5% Held in Ether",
            "image_url": null,
            "source_id": "bitcoin",
            "country": [
                "united states of america",
                "united kingdom",
                "india",
                "australia",
                "singapore",
                "saudi arabia",
                "canada"
            ],
            "category": [
                "business"
            ],
            "language": "english"
        },
        {
            "title": "Rupee surges 18 paise to close at 76.43 against U.S. dollar",
            "link": "https://www.thehindu.com/business/markets/rupee-surges-18-paise-to-close-at-7643-against-us-dollar/article65366655.ece",
            "keywords": null,
            "creator": [
                "\n        PTI  \n    "
            ],
            "video_url": null,
            "description": "On Thursday, the rupee had settled at 76.61 against the U.S. currency.",
            "content": null,
            "pubDate": "2022-04-29 11:00:28",
            "full_description": "The rupee appreciated on the expectation of better inflows. | Photo Credit: C. Venkatachalapathy The rupee appreciated 18 paise to settle at 76.43 (provisional) against the U.S. dollar on Friday, tracking a weak greenback overseas and fresh foreign fund inflows. At the interbank forex market, the domestic unit opened at 76.62 against the U.S. dollar. It moved in the range of 76.63 to 76.29 during the day trade. The rupee finally closed at 76.43, registering a rise of 18 paise over its previous close. On Thursday, the rupee had settled at 76.61 against the U.S. currency. According to HDFC Securities Research Analyst Dilip Parmar, the rupee appreciated on the expectation of better inflows, a retreat in the dollar index and a rebound in risk assets. \"Market participants are expecting good inflows in LIC IPO after the recent oversubscription of Campus Activewear,\" Mr. Parmar said. Moreover, the rupee has shown resilience among Asian currencies on the back of Central Bank intervention and inflows, he said. \"Dollar index is due for some consolidation under 104, given the technical indicators are registering some overbought readings. Bidders are waiting for a dip and positioning for a rally on the back of hawkish Federal Reserves and policy divergence with other developed nations,\" he noted. Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was trading 0.57% lower at 103.03. On the domestic equity market front, the 30-share BSE Sensex ended 460.19 points or 0.80% lower at 57,060.87, while the broader NSE Nifty fell 142.50 points or 0.83% to 17,102.55. Brent crude futures, the global oil benchmark, inched up 1.78% to $109.51 per barrel. Foreign institutional investors remained net buyers in the capital market on Thursday as they purchased shares worth ₹743.22 crore, according to stock exchange data. Our code of editorial values Printable version | Apr 29, 2022 4:48:36 pm | https://www.thehindu.com/business/markets/rupee-surges-18-paise-to-close-at-7643-against-us-dollar/article65366655.ece © THG PUBLISHING PVT LTD.",
            "image_url": null,
            "source_id": "thehindu",
            "country": [
                "india"
            ],
            "category": [
                "business"
            ],
            "language": "english"
        },
        {
            "title": "Bloomberg reporters in Turkey acquitted over 2018 currency crisis article",
            "link": "https://news.yahoo.com/bloomberg-reporters-turkey-acquitted-over-102704226.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": null,
            "content": null,
            "pubDate": "2022-04-29 10:27:04",
            "image_url": null,
            "source_id": "yahoo",
            "country": [
                "united states of america"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "title": "Second country to adopt Bitcoin as national currency is the Central African Republic",
            "link": "https://www.theverge.com/2022/4/29/23048142/bitcoin-adopted-official-currency-central-african-republic-car-why",
            "keywords": null,
            "creator": [
                "James Vincent"
            ],
            "video_url": null,
            "description": null,
            "content": "Illustration by Alex Castro / The Verge The Central African Republic (CAR) has become the second-ever country to adopt Bitcoin as a national currency, following El Salvador’s adoption of the cryptocurrency last year. CAR’s government says a bill to adopt Bitcoin was passed unanimously by the country’s parliament, reports Reuters and BBC News. (Though former CAR prime minister Martin Ziguele complained the bill was approved “by proclamation.”) The office of CAR president Faustin-Archange Touadera claimed the move would “improve the conditions of Central African citizens” and distinguish CAR as “of the world’s boldest and most visionary countries.” However, geopolitical analysts and financial experts are confused by motivations for the move. CAR is a landlocked nation that is rich in resources like gold and uranium, but remains one of the world’s poorest countries. It has been wracked by civil war since 2012, and only 11 percent of the 4.8 million population have access to the internet. It is one of six states in Africa to use the Central African CFA franc as its currency — “a regional currency that is backed by France and pegged to the Euro,” according to law firm Baker McKenzie. “It’s a big middle finger to the French economic system” Some have suggested that CAR’s adoption of Bitcoin is an attempt to undermine the CFA franc and offer a rebuke to the country’s former colonial power, France. “It’s a big middle finger to the French economic system,” Chris Maurice, CEO of cryptocurrency exchange Yellow Card, which focuses on users in Africa, told Reuters. Others say the move could be tied to CAR’s close relationship with Russia. CAR was one of the few nations that chose to abstain from a United Nations vote condemning Russia’s invasion of Ukraine, while the country’s government has been condemned for deploying mercenaries from Russia’s Wagner Group to fight rebel groups. “The context, given the systemic corruption and a Russian partner facing international sanctions, does encourage suspicion,” analyst Thierry Vircoulon of the French Institute of International Relations, told the AFP news agency (via BBC News).",
            "pubDate": "2022-04-29 10:21:35",
            "full_description": "The Central African Republic (CAR) has become the second-ever country to adopt Bitcoin as a national currency, following El Salvador’s adoption of the cryptocurrency last year. CAR’s government says a bill to adopt Bitcoin was passed unanimously by the country’s parliament, reports Reuters and BBC News . (Though former CAR prime minister Martin Ziguele complained the bill was approved “by proclamation.”) The office of CAR president Faustin-Archange Touadera claimed the move would “improve the conditions of Central African citizens” and distinguish CAR as “of the world’s boldest and most visionary countries.” However, geopolitical analysts and financial experts are confused by motivations for the move. CAR is a landlocked nation that is rich in resources like gold and uranium, but remains one of the world’s poorest countries. It has been wracked by civil war since 2012, and only 11 percent of the 4.8 million population have access to the internet. It is one of six states in Africa to use the Central African CFA franc as its currency — “a regional currency that is backed by France and pegged to the Euro,” according to law firm Baker McKenzie. Some have suggested that CAR’s adoption of Bitcoin is an attempt to undermine the CFA franc and offer a rebuke to the country’s former colonial power, France. “It’s a big middle finger to the French economic system,” Chris Maurice, CEO of cryptocurrency exchange Yellow Card, which focuses on users in Africa, told Reuters . Others say the move could be tied to CAR’s close relationship with Russia. CAR was one of the few nations that chose to abstain from a United Nations vote condemning Russia’s invasion of Ukraine, while the country’s government has been condemned for deploying mercenaries from Russia’s Wagner Group to fight rebel groups . “The context, given the systemic corruption and a Russian partner facing international sanctions, does encourage suspicion,” analyst Thierry Vircoulon of the French Institute of International Relations, told the AFP news agency (via BBC News ).",
            "image_url": null,
            "source_id": "theverge",
            "country": [
                "united states of america"
            ],
            "category": [
                "technology"
            ],
            "language": "english"
        },
        {
            "title": "Telegram users can now send crypto in-app via Toncoin, TON",
            "link": "https://www.techgenyz.com/2022/04/29/telegram-users-can-now-send-crypto-in-app-via-toncoin/",
            "keywords": [
                "Apps",
                "News",
                "Telegram"
            ],
            "creator": [
                "Yusuf Balogun"
            ],
            "video_url": null,
            "description": "Since the inception of Bitcoin in 2009, the cryptocurrency’s implementation has been quite visible to the general public. Because of its autonomy and convenience, the new type of currency has become a popular and viable source of currency all across the world. To serve as an alternative source of currency, various varieties of cryptocurrencies have […]",
            "content": null,
            "pubDate": "2022-04-29 09:42:40",
            "image_url": null,
            "source_id": "techgenyz",
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        },
        {
            "title": "Hong Kong Monetary Authority Unsure About Retail CBDC Launch",
            "link": "https://gadgets360.com/cryptocurrency/news/hong-kong-cbdc-stablecoin-ehkd-hkma-discussion-paper-2931469",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Hong Kong is pushing ahead with its exploration of a retail central bank digital currency (CBDC), launching a discussion paper on the policy and design aspects of a potential e-HKD.",
            "content": null,
            "pubDate": "2022-04-29 09:23:23",
            "full_description": "The Hong Kong Monetary Authority (HKMA), the Chinese Special Territory's central bank, has issued a discussion paper on the possible direction a Central Bank Digital Currency (CBDC) issued by Hong Kong could take. Referred to as the e-HKD by the HKMA, the paper focusses on the policy and design issues of a CBDC, but also tries to question whether the issuance of a CBDC should be necessary in the first place. The HKMA struggles to find any strong justification apart from innovation and has opened a public consultation on the topic. The HKMA also issued a warning in the discussion paper saying that stablecoins posed a risk to the stability of the Hong Kong dollar. The “e-HKD: A Policy and Design Perspective” discussion paper said, “In a scenario where the use of these stablecoins becomes widespread… the role of the domestic currency as the single unit of account could be undermined.” The HKMA mentioned the risks posed by stablecoins and how these private cryptocurrencies could undermine the integrity of the payment system because of failures in the operational and financial sectors. These stablecoins could also promote capital flight during periods of financial recession, undermining the control of the government over the local economy. Hong Kong commenced its official study about a CBDC in June last year. That said, the HKMA has been assessing the benefits of issuing a wholesale CBDC since 2017. The authority focuses on retail-focused CBDCs that target the general public and can be used as an alternative to fiat currencies in making daily transactions. As things stand, the HKMA has not given any commitment to launching a CBDC. The recent discussion paper has invited various industry leaders and the public to give detailed feedback about a CBDC and the potential benefits and risks of creating an e-HKD. The HKMA has also invited feedback about the design of the CBDC. The design features being considered include interoperability, the right retail-CBDC issuance mechanism, potential use cases, legal framework, privacy and consumer protection measures. The issuance of the discussion paper also shows Hong Kong's increased interest in launching CBDCs. The interest in CBDCs can be attributed to the rapid growth of the private cryptocurrency sector in the country, despite the high risks of volatility.",
            "image_url": "https://i.gadgets360cdn.com/large/Hong_kong_flag_pixabay_mrpremedvedved_small_1651223958827.jpg",
            "source_id": "ndtv",
            "country": [
                "india"
            ],
            "category": [
                "technology"
            ],
            "language": "english"
        },
        {
            "title": "Bitcoin price slow to react as US dollar rally stops at 20-year highs",
            "link": "https://cointelegraph.com/news/bitcoin-price-slow-to-react-as-us-dollar-rally-stops-at-20-year-highs",
            "keywords": [
                "Bitcoin",
                "BTC price",
                "DXY",
                "dollar strength index"
            ],
            "creator": [
                "Cointelegraph By William Suberg"
            ],
            "video_url": null,
            "description": "A failure to hold $40,000 comes as the U.S. dollar currency index finally weakens.",
            "content": null,
            "pubDate": "2022-04-29 09:10:43",
            "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDQvMjRlMjcxZDQtNzUzMy00NjZlLWI4ODMtODM0NmZjMDM2ODJiLmpwZw==.jpg",
            "source_id": "cointelegraph",
            "country": [
                "united states of america"
            ],
            "category": [
                "top",
                "business"
            ],
            "language": "english"
        },
        {
            "title": "Imran Khan in trouble over corruption allegations: From a multi-crore university for 37 students to his wife’s close friend’s illicit wealth after he became PM",
            "link": "https://www.opindia.com/2022/04/pakistan-imran-khan-corruption-farah-khan-al-qadir-university-probe/",
            "keywords": [
                "News Reports",
                "World",
                "corruption charges",
                "imran khan",
                "pakistan government"
            ],
            "creator": [
                "OpIndia Staff"
            ],
            "video_url": null,
            "description": "After being ousted, former Pakistan PM Imran Khan seems to be in troubled water over rampant corruption",
            "content": "After being ousted, former Pakistan PM Imran Khan seems to be in troubled water over rampant corruption. The National Accountability Bureau (NAB) on Thursday green signalled a thorough investigation into the illegal wealth of Farah Khan, a close friend of Khan’s wife Bushra Bibi. The NAB said that Farah had accumulated illegal assets beyond the known source of income since 2018. The NAB in its official statement noted that accounts of Farah Khan had displayed a huge turnover of around Rs 847 million in the past three years. It added that Khan earned her wealth through an unknown source of income as the numbers in her stated accounts did not match with that of the accounts of years before Imran Khan’s government came to power. “These credits were received in her personal account and withdrawn immediately after credit within a short time period,” it stated. The anti-graft body also stated that Khan had frequently travelled to foreign jurisdictions – nine times to the USA and six times to the UAE. Amid the allegations of corruption, however, Khan left for Dubai on April 5 this year. Her husband had left the country already. According to the reports, the NAB suspects that the Farah Khan has earned more financial wealth after the Imran Khan government came into power. Earlier, Farah Khan was seen flaunting her handbag costing $90000 on one of her flights to foreign countries. However, the saga of corruption is not limited to Farah Khan. Income earned by her family members including her husband, sister and father-in-law is also under the NAB scanner. It is important to note that former Pakistan Prime Minister Imran Khan is also being accused of massive corruption. Reports mention that Khan has looted the Pakistan government for more than Rs 40 crores (Pakistani currency). He employed 72-year-old lawyer Abdul Latif Yousufzai at the behest of the then speaker of the National Assembly Asad Kaisar Imran. The per month salary amount approved to Yousufzai was Rs 19 lakh (Pakistani currency). According to the reports, last year, the Pakistani government budget approved Rs 30 lakh to Yousufzai for sundry expenses inclusive of salary. Also, it is worth noting that Imran Khan had appointed more than 200 people in the Parliament secretariat at salaries that counted more than usual pay and all the appointed personnel were either his relatives or his close aides. Further, Khan in the year 2019 built a dream institution- Al Qadir University at the cost of Rs 56 crores (Pakistani currency) and appointed his wife Bushra Bibi as one of its Trustee members. The university that receives millions of rupees in the form of donations houses only 37 students today. Reportedly, Al Qadir management claims to be a university, but has not yet been recognized by the Punjab Higher Education Department. The trust has received donations amounting to Rs 180 million (Pakistani currency) from January 2021 to December 2021. From July 2020 to June 2021, the total income of the trust was Rs 101 million (Pakistani currency) and the total expenditure including the salaries of the staff and workers was around Rs 8.58 million (Pakistani currency). The anti-graft body has also approved a supplementary reference against former prime minister Shahid Khaqan Abbasi, his son Abdullah Khaqan Abbasi, Finance Minister Miftah Ismail and others, alleging that they had awarded the LNG Terminal-1 contract through ‘non-transparent sources’.",
            "pubDate": "2022-04-29 08:02:02",
            "image_url": null,
            "source_id": "opindia",
            "country": [
                "india"
            ],
            "category": [
                "top"
            ],
            "language": "english"
        }
    ],
    "nextPage": 1
}